# Brewfile

# Make sure we have all the taps we need before beginning.
tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions' # Use if you need to install alternate versions of Casks (e.g. betas, nightly releases, old versions) 

brew 'autojump'
brew 'coreutils'
brew 'couchdb'
brew 'fasd'
brew 'gifsicle'
brew 'git'
brew 'graphicsmagick'
brew 'imagemagick'
brew 'mas'
brew 'pngquant'
brew 'rbenv'
brew 'wifi-password'
brew 'wget'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'

# Casks
cask_args appdir: '/Applications'

cask 'alfred'
cask 'colorpicker-skalacolor'
cask 'docker'
cask 'dropbox'
cask 'epichrome'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kap'
cask 'now'
cask 'openemu'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'

# Mac App Store applications
mas "Gifwit", id: 871200983
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixave", id: 924891282
mas "Reeder", id: 1449412482
mas "Sip", id: 507257563
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
