# Brewfile

# Make sure we have all the taps we need before beginning.
tap 'homebrew/boneyard'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/php'

tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'autojump'
brew 'coreutils'
brew 'couchdb'
brew 'drush'
brew 'fasd'
brew 'gifsicle'
brew 'git'
brew 'graphicsmagick'
brew 'imagemagick'
brew 'mongodb'
brew 'pngquant'
brew 'rbenv'
brew 'wifi-password'
brew 'wget'
brew 'yarn'

# Casks
cask_args appdir: '/Applications'

cask 'alfred'
cask 'colorpicker-skalacolor'
cask 'dropbox'
cask 'epichrome'
cask 'firefox'
cask 'github-desktop'
# cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
# cask 'iterm2-beta'
# cask 'kaleidoscope'
cask 'licecap'
cask 'liteicon'
# cask 'moom'
cask 'openemu'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
# cask 'slicy'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
