# Brewfile

# Make sure we have all the taps we need before beginning.
tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'autojump'
brew 'coreutils'
brew 'couchdb'
brew 'fasd'
brew 'gifsicle'
brew 'git'
brew 'graphicsmagick'
brew 'imagemagick'
brew 'mongodb'
brew 'pngquant'
brew 'rbenv'
brew 'wifi-password'
brew 'wget'

# Casks
cask_args appdir: '/Applications'

cask 'alfred'
cask 'colorpicker-skalacolor'
cask 'docker'
cask 'dropbox'
cask 'epichrome'
cask 'firefox'
cask 'google-chrome'
# cask 'hyper'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
# cask 'kaleidoscope'
cask 'kap'
# cask 'moom'
cask 'now'
cask 'openemu'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
# cask 'slicy'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'tunnelblick'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
